# Задача 1
# Введення три цифри від користувача
# number1 = float(input("Введіть перше число: "))
# number2 = float(input("Введіть друге число: "))
# number3 = float(input("Введіть третє число: "))
#
# # Обчислення суми та добутку чисел
# suma = number1 + number2 + number3
# dobutok = number1 * number2 * number3
#
# # Виведення результату на екран
# print(f"Сума введених чисел: {suma}")
# print(f"Добуток введених чисел: {dobutok}")

# Задача 2
# def obchyslennia_ploshchi_romba(ac, bd):
#     # Обчислення площі ромба
#     ploshcha = (ac * bd) / 2
#     return ploshcha
#
# # Введення довжин діагоналей від користувача
# ac = float(input("Введіть довжину першої діагоналі: "))
# bd = float(input("Введіть довжину другої діагоналі: "))
#
# # Обчислення та виведення площі ромба
# ploshcha_romba = obchyslennia_ploshchi_romba(ac, bd)
# print(f"Площа ромба з діагоналями {ac} і {bd} дорівнює: {ploshcha_romba}")

# Доп задача 3
# Задача 1
# Введення три цифри від користувача
# number1 = float(input("Введіть перше число: "))
# number2 = float(input("Введіть друге число: "))
# number3 = float(input("Введіть третє число: "))
# number4 = float(input("Введіть четверте число: "))
#
# # Обчислення добутку чисел
# dobutok = number1 * number2 * number3 * number4
#
# # Виведення результату на екран
# print(f"Добуток введених чисел: {dobutok}")